In [26]:
import pandas as pd
import matplotlib.pyplot as plt
df = pd.read_csv("Employee.csv")
print(df.head())
print(df.shape)

   Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0  Bachelors         2017  Bangalore            3   34    Male          No
1  Bachelors         2013       Pune            1   28  Female          No
2  Bachelors         2014  New Delhi            3   38  Female          No
3    Masters         2016  Bangalore            3   27    Male          No
4    Masters         2017       Pune            3   24    Male         Yes

   ExperienceInCurrentDomain  LeaveOrNot
0                          0           0
1                          3           1
2                          2           0
3                          5           1
4                          2           1
(4653, 9)

In [5]:
print(df.columns)
df.info()
df.describe()

Index(['Education', 'JoiningYear', 'City', 'PaymentTier', 'Age', 'Gender',
       'EverBenched', 'ExperienceInCurrentDomain', 'LeaveOrNot'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB

,JoiningYear,PaymentTier,Age,ExperienceInCurrentDomain,LeaveOrNot
count,4653.000000,4653.000000,4653.000000,4653.000000,4653.000000
mean,2015.062970,2.698259,29.393295,2.905652,0.343864
std,1.863377,0.561435,4.826087,1.558240,0.475047
min,2012.000000,1.000000,22.000000,0.000000,0.000000
25%,2013.000000,3.000000,26.000000,2.000000,0.000000
50%,2015.000000,3.000000,28.000000,3.000000,0.000000
75%,2017.000000,3.000000,32.000000,4.000000,1.000000
max,2018.000000,3.000000,41.000000,7.000000,1.000000

In [29]:
print(df["Age"].max())
print(df["Age"].min())
print(df["LeaveOrNot"].value_counts())
print()
print(df["Education"].value_counts())
print()
print(df["EverBenched"].value_counts())
print()
print(df["ExperienceInCurrentDomain"].value_counts())

41
22
LeaveOrNot
0    3053
1    1600
Name: count, dtype: int64

Education
Bachelors    3601
Masters       873
PHD           179
Name: count, dtype: int64

EverBenched
No     4175
Yes     478
Name: count, dtype: int64

ExperienceInCurrentDomain
2    1087
4     931
5     919
3     786
1     558
0     355
7       9
6       8
Name: count, dtype: int64

In [ ]:
print(df[df["City"] == "Bangalore"].head())
print(df[df["City"] == "New Delhi"].head())

    Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
0   Bachelors         2017  Bangalore            3   34    Male          No
3     Masters         2016  Bangalore            3   27    Male          No
5   Bachelors         2016  Bangalore            3   22    Male          No
7   Bachelors         2016  Bangalore            3   34  Female          No
10    Masters         2012  Bangalore            3   27    Male          No

    ExperienceInCurrentDomain  LeaveOrNot
0                           0           0
3                           5           1
5                           0           0
7                           2           1
10                          5           1
    Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
2   Bachelors         2014  New Delhi            3   38  Female          No
6   Bachelors         2015  New Delhi            3   38    Male          No
9     Masters         2017  New Delhi            2   37    Male          No
19  Bachelors         2016  New Delhi            2   22  Female          No
21    Masters         2017  New Delhi            2   28    Male          No

    ExperienceInCurrentDomain  LeaveOrNot
2                           2           0
6                           0           0
9                           2           0
19                          0           1
21                          4           0

In [37]:
print(df.sort_values("Age"))

      Education  JoiningYear       City  PaymentTier  Age  Gender EverBenched  \
4069    Masters         2013  New Delhi            2   22    Male         Yes
4539  Bachelors         2014  Bangalore            3   22  Female          No
4048  Bachelors         2014  Bangalore            3   22    Male          No
4070  Bachelors         2015       Pune            1   22  Female          No
4561  Bachelors         2013  Bangalore            3   22    Male          No
...         ...          ...        ...          ...  ...     ...         ...
3394  Bachelors         2013  Bangalore            3   41    Male          No
3355  Bachelors         2016  Bangalore            3   41    Male          No
3500  Bachelors         2017  Bangalore            3   41    Male          No
3527  Bachelors         2017  New Delhi            3   41    Male          No
3386    Masters         2013       Pune            2   41    Male          No

      ExperienceInCurrentDomain  LeaveOrNot
4069                          0           1
4539                          0           0
4048                          0           0
4070                          0           1
4561                          0           1
...                         ...         ...
3394                          2           0
3355                          4           0
3500                          1           0
3527                          2           0
3386                          2           1

[4653 rows x 9 columns]